app/controllers/api/users_controller.rb

  def create
    user = User.new(user_params)
    user.key = SecureRandom.hex(20)

    if user.save
---
INSERT INTO "users" ("email", "phone_number", "full_name", "password_digest", "key", "account_key", "metadata", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"